---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.SetBorderAroundSections(Autodesk.Revit.DB.ElementId)
source: html/c25694a5-1778-1223-df13-f55ecd02d8ad.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.SetBorderAroundSections Method

Adds a border around the sections

## Syntax (C#)
```csharp
public void SetBorderAroundSections(
	ElementId borderId
)
```

## Parameters
- **borderId** (`Autodesk.Revit.DB.ElementId`) - The border to set around the sections

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null